#include <stdio.h>

/* 猴子吃桃问题：
    猴子第一天摘了若干个桃子，当即吃了一半，不过瘾，又吃了一个，第二天早上又将剩下的桃子吃了一半，
    又多吃了一个。以后每天都吃了前一天的一半多一个，到第 10 天只剩一个桃子。求第一天吃了多少？
*/

int main(void) {
    int day = 9;
    int x1;
    int x2 = 1;

    while (day > 0) {
        x1 = (x2 + 1) * 2;
        x2 = x1;
        day--;
    }

    printf("猴子第一天吃了 %d 颗桃\n", x1 / 2 + 1);

    return 0;
}

/*
    10: 1
    09: 1 + 1 = 2 * 2 = 4
    08: 4 + 1 = 5 * 2 = 10
    07: 10 + 1 = 11 * 2 = 22
    06: 22 + 1 = 23 * 2 = 46
    05: 46 + 1 = 47 * 2 = 94
    04: 94 + 1 = 95 * 2 = 190
    03: 190 + 1 = 191 * 2 = 382
    02: 382 + 1 = 383 * 2 = 766
    01: 766 + 1 = 767 * 2 = 1534
*/
